porousVent/benchmark_schmidtModel/schmidtModel/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ceiling
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    acu8EFB35119AA4591115D9D1BF6014FA4C_fixedWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

                        acu8EFB35119AA4591115D9D1BF6014FA4C_inlet
            {
                type            inletOutlet;     // was: flowRateInletVelocity
                inletValue    uniform (0 0 0);
                value        uniform (0 0 0);
                            }
                acu8EFB35119AA4591115D9D1BF6014FA4C_outlet
        {
            type                flowRateInletVelocity;
            volumetricFlowRate  1.2; // m3/s
        }
         acu65E0157C3F4FD3DBFB846500AB325745_fixedWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

                        acu65E0157C3F4FD3DBFB846500AB325745_inlet
            {
                type                flowRateInletVelocity;
                volumetricFlowRate  -1.2;
            }
                acu65E0157C3F4FD3DBFB846500AB325745_outlet
        {
            type                flowRateInletVelocity;
            volumetricFlowRate  1.2; // m3/s
        }
         oldInternalFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
