porousVent/benchmark_schmidtModel/schmidtModel/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    floor
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    ceiling
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    fixedWalls
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    acu8EFB35119AA4591115D9D1BF6014FA4C_fixedWall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

            acu8EFB35119AA4591115D9D1BF6014FA4C_inlet
        {
            type            zeroGradient;
        }
        acu8EFB35119AA4591115D9D1BF6014FA4C_outlet
        {
            type            fixedValue;
            value           uniform 0.00184;
        }
        acu65E0157C3F4FD3DBFB846500AB325745_fixedWall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

            acu65E0157C3F4FD3DBFB846500AB325745_inlet
        {
            type            zeroGradient;
        }
        acu65E0157C3F4FD3DBFB846500AB325745_outlet
        {
            type            fixedValue;
            value           uniform 0.00184;
        }
        oldInternalFaces
    {
        type            empty;
    }
}
// ************************************************************************* //